tutorials/dyMFoam/cylSym2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: dualFuelEngline addition to OpenFOAM v7
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.4-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

// Initial piston position: -40 at BDC or 930 at EVO
z0 -40;

vertices
(
    /*   3------2   00 */ (400 -35   0)
    /*  /|     /|   01 */ (350 -15   0)
    /* 7------6 |   02 */ (350 -15 200)
    /* | |    | |   03 */ (400 -35 200)
    /* | |    | |   04 */ (400 -5    0)
    /* | 0----|-1   05 */ (350  15   0)
    /* |/     |/    06 */ (350  15 200)
    /* 4------5     07 */ (400 -5  200)

    /*   11------10 08 */ (350 -70  $z0)
    /*   /|     /|  09 */ (150 -30  $z0)
    /* 15------14|  10 */ (150 -30 3400)
    /*  | |    | |  11 */ (350 -70 3280) // 3280 = chamfer 120 mm
    /*  | |    | |  12 */ (350  70  $z0)
    /*  | 8----|-9  13 */ (150  30  $z0)
    /*  |/     |/   14 */ (150  30 3400)
    /* 12------13   15 */ (350  70 3280) // 3280 = chamfer 120 mm

    /*      10      16 */ (  0  0  $z0)
    /*     /|\      17 */ (  0  0 3400)
    /*    / | \        */
    /*   14----17      */
    /*   |  |  |       */
    /*   |  9  |       */
    /*   | / \ |       */
    /*   |/   \|       */
    /*   13---16       */

    /*   21------20 18 */ (400 -7 1480)
    /*   /|     /|  19 */ (350 -7 1480)
    /* 25------24|  20 */ (350 -7 1500)
    /*  | |    | |  21 */ (400 -7 1500)
    /*  | |    | |  22 */ (400  7 1480)
    /*  |18----|-19 23 */ (350  7 1480)
    /*  |/     |/   24 */ (350  7 1500)
    /* 22------23   25 */ (400  7 1500)
);

blocks
(
    hex (0   1  2  3  4  5  6  7) (3 10 1) simpleGrading (1 1 1)
    hex (8   9 10 11 12 13 14 15) (4 50 2) simpleGrading (1 1 1)
    hex (9  16 17 10 13 16 17 14) (3 50 2) simpleGrading (1 1 1)
    hex (18 19 20 21 22 23 24 25) (3  1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
/* Inlet channel */
    inlet
    {
        type            patch;
        faces           ((0 4 7 3));
    }
    inlet_front
    {
        type            wall; //wedge;
        faces           ((0 1 2 3));
    }
    inlet_back
    {
        type            wall; //wedge;
        faces           ((4 5 6 7));
    }
    inlet_topAndBottom
    {
        type            wall;
        faces
        (
            (0 1 4 5)
            (3 2 6 7)
        );
    }

/* Injection channel */
    injection
    {
        type            patch;
        faces           ((18 22 25 21));
    }
    injection_front
    {
        type            wall; //wedge;
        faces           ((18 19 20 21));
    }
    injection_back
    {
        type            wall; //wedge;
        faces           ((22 23 24 25));
    }
    injection_topAndBottom
    {
        type            wall;
        faces
        (
            (18 19 23 22)
            (21 20 24 25)
        );
    }

/* Cylinder */
    axis
    {
        type            patch;
        faces           ((16 17 17 16));
    }
    cyl_back
    {
        type            cyclic;
        neighbourPatch  cyl_front;
        faces
        (
            (8  9 10 11)
            (9 16 17 10)
        );
    }
    cyl_front
    {
        type            cyclic;
        neighbourPatch  cyl_back;
        faces
        (
            (12 13 14 15)
            (13 16 17 14)
        );
    }
    cyl_top
    {
        type            patch;
        faces           ((11 15 14 10));
    }
    outlet
    {
        type            patch;
        faces           ((10 14 17 17));
    }
    piston // = "cyl_bot"
    {
        type            wall;
        faces
        (
                        (9 13 12  8)
                        (9 13 16 16)
        );
    }

/* ACMI patches */
    couple1
    {
        type            patch;
        faces
        (
            ( 2  6  5  1) // inlet channel outlet
            (20 24 23 19) // injection channel outlet
        );
    }
    couple2
    {
        type            patch;
        faces           ((8 12 15 11)); // cylinder inlet
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
