tutorials/dyMFoam/cylSym2D/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: Addition to OpenFOAM v6
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.3-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions              [0 2 -2 0 0 0 0];

internalField           uniform 1.160; // 1.160*287.3*293.15 = 97697.5142

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

/* Inlet & Injection */
    injection
    {
        type            zeroGradient;
    }
    inlet
    {
        $injection
    }

/* Outlet */
    outlet
    {
        type            fixedValue;
        value           uniform 0.23e+06;
    }

/* Walls */
    piston
    {
        type            zeroGradient;
    }
    "cyl_top|(injection|inlet)_(back|front|topAndBottom)"
    {
        type            zeroGradient;
    }

/* ACMI patches */
    "ACMI(1|2)_couple"
    {
        type            cyclicACMI;
        value           $internalField;
    }
    "ACMI(1|2)_blockage"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
