tutorials/dyMFoam/cylSym2D/0/include/motionUBoundaryField
boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

/* Inlet & Injection */
    "injection|inlet"
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }

/* Outlet */
    outlet
    {
        $inlet
    }

/* Walls */
    piston
    {
        type            uniformFixedValue;
        uniformValue
        { 
            type        sine;
            frequency   1.4286; // n/60
            amplitude   25; // pi*S*n/30 = pi*2.7*92/30
            start       0; // .154 // EVO/6/n = 85/6/92
            level       0; // offset

            scale       1; /* OpenFOAM v7 or lower */
        }
    }
    axis
    {
        type            slip;
    }
    "cyl_top|(injection|inlet)_(topAndBottom|back|front)"
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }

/* ACMI & cyclic patches */
    ACMI1_couple
    {
        type            uniformFixedValue;
        patchType       cyclicACMI;
        uniformValue    0;
    }
    ACMI1_blockage
    {
        type            uniformFixedValue;
        uniformValue    0;
    }
    ACMI2_couple
    {
        type            slip;
        patchType       cyclicACMI;
        value           uniform 0;
    }
    ACMI2_blockage
    {
        type            slip;
        value           uniform 0;
    }
}
