tutorials/dyMFoam/cylSym2D/0/k.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-3;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

/* Inlet & Injection */
    injection
    {
        type            fixedValue;
        value           $internalField;
    }
    inlet
    {
        $injection
    }

/* Outlet */
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

/* Walls */
    piston
    {
        type            zeroGradient;
    }
    "cyl_top|(injection|inlet)_(back|front|topAndBottom)"
    {
        type            zeroGradient;
    }

/* ACMI patches */
    "ACMI(1|2)_blockage"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    "ACMI(1|2)_couple"
    {
        type            cyclicACMI;
        value           $internalField;
    }
}


// ************************************************************************* //
