tutorials/dyMFoam/cylSym2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp ../../../etc/AllcleanAllrunAny.foam ${PWD##*/}.foam

./Allmesh
runApplication $(getApplication)

# runApplication decomposePar
# runParallel $(getApplication)
# runApplication reconstructPar

# -----------------------------------------------------------------------------